#### Prod Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.stripe_product.vst["acid-saturator"]: Refreshing state... [id=prod_U2u1zS7klzBOhw]
module.backend.null_resource.install_dependencies: Refreshing state... [id=1338761846404791356]
module.backend.local_file.product_config: Refreshing state... [id=eb511dece59e2398a2fccefb451c970c88dc5ade]
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.data.archive_file.my_purchases_zip: Reading...
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.data.archive_file.my_purchases_zip: Read complete after 0s [id=cdb72f57c6a904c8cfb8062b50e33356f1239e55]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=35a359675c0e7dbcc21d22aceb891002c8c25a18]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:212984412001:certificate/9b4ed69d-3598-4a7d-b174-9eed1061269d]
module.backend.stripe_price.vst_price["acid-saturator"]: Refreshing state... [id=price_1T5GnNDyEyPnHPBngyFQwMSu]
data.aws_route53_zone.main: Reading...
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=ps1frit3ub]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-prod]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-prod]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-prod-195481994910]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_u7h4b6cDw]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=1ogy5n]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=vijo3s]
module.backend.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-ps1frit3ub-DEFAULT_5XX]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=z1n13q]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-ps1frit3ub-DEFAULT_4XX]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=3403615ee77b9868b514dfdad15b6d3da925c49b]
module.backend.aws_api_gateway_resource.my_purchases: Refreshing state... [id=sa4tvo]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:13]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-vijo3s-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-1ogy5n-OPTIONS]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-ps1frit3ub-z1n13q-POST]
data.aws_route53_zone.main: Read complete after 0s [id=Z06097315D9JJ3K3FJQA]
aws_route53_record.cert_validation["houseaudio.net"]: Refreshing state... [id=Z06097315D9JJ3K3FJQA__9ef75d09df2a6d116c5b7077d5fc43a6.houseaudio.net._CNAME]
module.backend.module.my_purchases_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-sa4tvo-OPTIONS]
module.backend.aws_lambda_function.my_purchases: Refreshing state... [id=vstshop-my-purchases-prod]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-vijo3s-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-vijo3s-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-1ogy5n-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-1ogy5n-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-sa4tvo-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-sa4tvo-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-1ogy5n-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-vijo3s-OPTIONS-200]
aws_acm_certificate_validation.cert_verify: Refreshing state... [id=2026-02-27 02:29:07.007 +0000 UTC]
module.backend.module.my_purchases_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-sa4tvo-OPTIONS-200]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-prod]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3LS99DT2QX8JW]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=ef4w2c]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-prod-vst-prod-123]
module.backend.aws_lambda_permission.api_gw_my_purchases: Refreshing state... [id=AllowExecutionFromAPIGatewayPurchases]
module.backend.aws_api_gateway_method.my_purchases_get: Refreshing state... [id=agm-ps1frit3ub-sa4tvo-GET]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-ps1frit3ub-1ogy5n-GET]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-ps1frit3ub-vijo3s-POST]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-ps1frit3ub-z1n13q-POST]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-prod-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-prod]
module.backend.aws_api_gateway_integration.my_purchases_int: Refreshing state... [id=agi-ps1frit3ub-sa4tvo-GET]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-prod/arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-ps1frit3ub-1ogy5n-GET]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2LWH7IMK7IDCO]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-prod123]
aws_route53_record.apex_a: Refreshing state... [id=Z06097315D9JJ3K3FJQA_houseaudio.net_A]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-prod-195481994910]
aws_route53_record.apex_aaaa: Refreshing state... [id=Z06097315D9JJ3K3FJQA_houseaudio.net_AAAA]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=722e9mqi8aag4njin0oafbbe8s]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-prod]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-ps1frit3ub-vijo3s-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=wb8ymn]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-ps1frit3ub-prod]
local_file.env_file: Refreshing state... [id=12641c75deb9cc79351cbfeeaa1e6ea1aa4f3db0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_u7h4b6cDw
            VITE_USER_POOL_CLIENT_ID=722e9mqi8aag4njin0oafbbe8s
            VITE_API_URL=https://ps1frit3ub.execute-api.us-east-2.amazonaws.com/prod
            VITE_CLOUDFRONT_URL=https://houseaudio.net
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-ps1frit3ub-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-ps1frit3ub-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-prod"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:13",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-prod"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:13",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:13" -> (known after apply)
      ~ code_sha256                 = "LT5y3a+zjsOSjC7De0gk5zCOR/QwIjgcFSiNVaGkJc4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-28T19:28:43.105+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "LT5y3a+zjsOSjC7De0gk5zCOR/QwIjgcFSiNVaGkJc4=" -> "MpsxqCHHxNQRW6yFLMssD+997AQoXODHIHw9zW4/Hlc=" # forces replacement
      ~ source_code_size            = 4679852 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.local_file.product_config will be created
  + resource "local_file" "product_config" {
      + content              = jsonencode(
            [
              + {
                  + id        = "acid-saturator"
                  + imagePath = "product-media/acid-saturator-gui.png"
                  + name      = "Acid Saturator"
                  + price     = "$12.99"
                  + youtubeId = "dQw4w9WgXcQ"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>